spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_associated_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_2mrtyjEbsOCC9V
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.4
      Authorization:
      - Bearer sk_test_vHVA81mPc6q71Tpg7bl5Nhoe
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.4","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        MacbookAir.local 12.5.0 Darwin Kernel Version 12.5.0: Sun Sep 29 13:33:47
        PDT 2013; root:xnu-2050.48.12~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Oct 2013 12:07:10 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1584'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"evt_2mrtyjEbsOCC9V\",\n  \"created\": 1382259957,\n
        \ \"livemode\": false,\n  \"type\": \"charge.succeeded\",\n  \"data\": {\n
        \   \"object\": {\n      \"id\": \"ch_2mrtVWGvmLCW8u\",\n      \"object\":
        \"charge\",\n      \"created\": 1382259956,\n      \"livemode\": false,\n
        \     \"paid\": true,\n      \"amount\": 999,\n      \"currency\": \"usd\",\n
        \     \"refunded\": false,\n      \"card\": {\n        \"id\": \"card_2mrtjxzEgBWaKi\",\n
        \       \"object\": \"card\",\n        \"last4\": \"4242\",\n        \"type\":
        \"Visa\",\n        \"exp_month\": 10,\n        \"exp_year\": 2017,\n        \"fingerprint\":
        \"KniHAbbP8edNQ7pX\",\n        \"customer\": \"cus_2mrtGr8E8TYlqT\",\n        \"country\":
        \"US\",\n        \"name\": null,\n        \"address_line1\": null,\n        \"address_line2\":
        null,\n        \"address_city\": null,\n        \"address_state\": null,\n
        \       \"address_zip\": null,\n        \"address_country\": null,\n        \"cvc_check\":
        \"pass\",\n        \"address_line1_check\": null,\n        \"address_zip_check\":
        null\n      },\n      \"captured\": true,\n      \"balance_transaction\":
        \"txn_2mrtbaOWOnJgmD\",\n      \"failure_message\": null,\n      \"failure_code\":
        null,\n      \"amount_refunded\": 0,\n      \"customer\": \"cus_2mrtGr8E8TYlqT\",\n
        \     \"invoice\": \"in_2mrtke0Zakn9Xt\",\n      \"description\": null,\n
        \     \"dispute\": null,\n      \"metadata\": {},\n      \"fee\": 59,\n      \"fee_details\":
        [\n        {\n          \"amount\": 59,\n          \"currency\": \"usd\",\n
        \         \"type\": \"stripe_fee\",\n          \"description\": \"Stripe processing
        fees\",\n          \"application\": null\n        }\n      ]\n    }\n  },\n
        \ \"object\": \"event\",\n  \"pending_webhooks\": 0,\n  \"request\": \"iar_2mrtkmb1oswg1l\"\n}\n"
    http_version: 
  recorded_at: Sun, 20 Oct 2013 12:07:12 GMT
recorded_with: VCR 2.5.0
